app/controllers/courses_controller.rb

SELECT  "courses".* FROM "courses" WHERE (title LIKE '%sci%' OR prof LIKE '%sci%') ORDER BY "courses"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT  "courses".* FROM "courses" ORDER BY "courses"."title" DESC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "courses"
---
   def index
    search = params[:term].present? ? params[:term] : nil
    @courses = if search
      Course.where("title LIKE ? OR prof LIKE ?", "%#{search}%", "%#{search}%").page(params[:page]).per(10).order(:title)
       # Course.search
    else
       Course.page(params[:page]).per(10).order(:title)

INSERT INTO "courses" ("title", "prof", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "science 101"], ["prof", "Dr. evolution"], ["created_at", 2017-11-15 23:26:16 UTC], ["updated_at", 2017-11-15 23:26:16 UTC]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save