app/controllers/courses_controller.rb

SELECT  "courses".* FROM "courses" ORDER BY "courses"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
---
   def index
    search = params[:term].present? ? params[:term] : nil
    @courses = if search
      Course.where("title LIKE ? OR prof LIKE ?", "%#{search}%", "%#{search}%")
       # Course.search
    else
       Course.page(params[:page]).per(5).order(created_at: :desc)