app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE ("events"."start" BETWEEN $1 AND $2)  [["start", "2017-10-29"], ["start", "2017-12-10"]]
---
  def index
    @events = current_user.events.where(start: params[:start]..params[:end])

INSERT INTO "events" ("title", "start", "end", "color", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "tetete"], ["start", 2017-10-31 00:00:00 UTC], ["end", 2017-11-01 00:00:00 UTC], ["color", "green"], ["created_at", 2017-11-14 22:17:45 UTC], ["updated_at", 2017-11-14 22:17:45 UTC]]
---
  def create
    @event = current_user.events.new(event_params)
    @event.save

UPDATE "events" SET "start" = $1, "end" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["start", 2017-11-01 00:00:00 UTC], ["end", 2017-11-02 00:00:00 UTC], ["updated_at", 2017-11-14 21:11:59 UTC], ["id", 6]]
---
  def update
    @event.update(event_params)