app/controllers/recurring_events_controller.rb

  def create
    @recurring_event = current_user.recurring_events.new(recurring_event_params)
    @recurring_event.save
---
INSERT INTO "recurring_events" ("title", "anchor", "color", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "hhhh"], ["anchor", Thu, 16 Nov 2017], ["color", "red"], ["created_at", 2017-11-16 21:35:49 UTC], ["updated_at", 2017-11-16 21:35:49 UTC], ["user_id", 1]]

  def update
    if params[:event]
      @recurring_event.update(anchor: params[:event][:start])
---
UPDATE "recurring_events" SET "anchor" = $1, "updated_at" = $2 WHERE "recurring_events"."id" = $3  [["anchor", Fri, 17 Nov 2017], ["updated_at", 2017-11-16 21:35:54 UTC], ["id", 1]]

  def set_recurring_event
    @recurring_event = RecurringEvent.find(params[:id])
---
SELECT  "recurring_events".* FROM "recurring_events" WHERE "recurring_events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]